In [1]:
import pandas as pd

people = {'First' : ['Rajat','Aryan','Rahul','Nathan'],
          'Last'  : ['Prakash','Suman','Kumar','Head'],
          'Email' : ['rajat.prakash@intelegencia.com','aryan.suman@tester.com','rahul.kumar@GreaterNoida.com','Nathan.Head@eluxury.com']}

In [4]:
people

{'First': ['Rajat', 'Aryan', 'Rahul', 'Nathan'],
 'Last': ['Prakash', 'Suman', 'Kumar', 'Head'],
 'Email': ['rajat.prakash@intelegencia.com',
  'aryan.suman@tester.com',
  'rahul.kumar@GreaterNoida.com',
  'Nathan.Head@eluxury.com']}

In [6]:
df = pd.DataFrame(people)
df

    First     Last                           Email
0   Rajat  Prakash  rajat.prakash@intelegencia.com
1   Aryan    Suman          aryan.suman@tester.com
2   Rahul    Kumar    rahul.kumar@GreaterNoida.com
3  Nathan     Head         Nathan.Head@eluxury.com

In [9]:
type(df['Email'])

pandas.core.series.Series

In [11]:
df.Email

0    rajat.prakash@intelegencia.com
1            aryan.suman@tester.com
2      rahul.kumar@GreaterNoida.com
3           Nathan.Head@eluxury.com
Name: Email, dtype: object

## Accessing Multiple Columns

In [13]:
df[['First','Email']]

    First                           Email
0   Rajat  rajat.prakash@intelegencia.com
1   Aryan          aryan.suman@tester.com
2   Rahul    rahul.kumar@GreaterNoida.com
3  Nathan         Nathan.Head@eluxury.com

In [15]:
type(df[['First','Email']])

pandas.core.frame.DataFrame

In [17]:
df.columns

Index(['First', 'Last', 'Email'], dtype='object')

## LOC and ILOC

In [19]:
df.iloc[0] # 1 row

First                             Rajat
Last                            Prakash
Email    rajat.prakash@intelegencia.com
Name: 0, dtype: object

In [20]:
df.iloc[2]

First                           Rahul
Last                            Kumar
Email    rahul.kumar@GreaterNoida.com
Name: 2, dtype: object

In [22]:
type(df.iloc[1])

pandas.core.series.Series

In [28]:
df.iloc[[0,1,2],[0,1]]  # df.iloc[[rows],[Columns]]

   First     Last
0  Rajat  Prakash
1  Aryan    Suman
2  Rahul    Kumar

In [34]:
df.iloc[1:2,[2]]

                    Email
1  aryan.suman@tester.com

In [38]:
df.loc[[0,1],['Email','Last']]

                            Email     Last
0  rajat.prakash@intelegencia.com  Prakash
1          aryan.suman@tester.com    Suman

In [39]:
df = pd.read_csv(r'C:\Users\rajat.prakash\Desktop\Remote_repo\Data\Data_Analysis\Stack Data\survey_results_public.csv')

In [41]:
df.columns

Index(['Respondent', 'MainBranch', 'Hobbyist', 'Age', 'Age1stCode', 'CompFreq',
       'CompTotal', 'ConvertedComp', 'Country', 'CurrencyDesc',
       'CurrencySymbol', 'DatabaseDesireNextYear', 'DatabaseWorkedWith',
       'DevType', 'EdLevel', 'Employment', 'Ethnicity', 'Gender', 'JobFactors',
       'JobSat', 'JobSeek', 'LanguageDesireNextYear', 'LanguageWorkedWith',
       'MiscTechDesireNextYear', 'MiscTechWorkedWith',
       'NEWCollabToolsDesireNextYear', 'NEWCollabToolsWorkedWith', 'NEWDevOps',
       'NEWDevOpsImpt', 'NEWEdImpt', 'NEWJobHunt', 'NEWJobHuntResearch',
       'NEWLearn', 'NEWOffTopic', 'NEWOnboardGood', 'NEWOtherComms',
       'NEWOvertime', 'NEWPurchaseResearch', 'NEWPurpleLink', 'NEWSOSites',
       'NEWStuck', 'OpSys', 'OrgSize', 'PlatformDesireNextYear',
       'PlatformWorkedWith', 'PurchaseWhat', 'Sexuality', 'SOAccount',
       'SOComm', 'SOPartFreq', 'SOVisitFreq', 'SurveyEase', 'SurveyLength',
       'Trans', 'UndergradMajor', 'WebframeDesireNextYear',
       'WebframeWorkedWith', 'WelcomeChange', 'WorkWeekHrs', 'YearsCode',
       'YearsCodePro'],
      dtype='object')

In [43]:
df.iloc[[0,1,2],2:5]

  Hobbyist  Age Age1stCode
0      Yes  NaN         13
1       No  NaN         19
2      Yes  NaN         15

In [45]:
df.iloc[1:5,3:6]

    Age Age1stCode CompFreq
1   NaN         19      NaN
2   NaN         15      NaN
3  25.0         18      NaN
4  31.0         16      NaN

In [47]:
df.loc[[1,2,3,4],['Age','OrgSize']]

    Age                   OrgSize
1   NaN  1,000 to 4,999 employees
2   NaN                       NaN
3  25.0        20 to 99 employees
4  31.0                       NaN